БПКР/src/Enums/ТипыПодключаемогоОборудования/ТипыПодключаемогоОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПодключаемогоОборудования</name>
  <enumValues>
    <name>СканерШтрихкода</name>
    <comment>Scanner</comment>
  </enumValues>
  <enumValues>
    <name>СчитывательМагнитныхКарт</name>
    <comment>MSR</comment>
  </enumValues>
  <enumValues>
    <name>ККТ</name>
    <comment>KKT</comment>
  </enumValues>
  <enumValues>
    <name>ФискальныйРегистратор</name>
    <comment>FiscalPrinter</comment>
  </enumValues>
  <enumValues>
    <name>ПринтерЧеков</name>
    <comment>ReceiptPrinter</comment>
  </enumValues>
  <enumValues>
    <name>ДисплейПокупателя</name>
    <comment>LineDisplay</comment>
  </enumValues>
  <enumValues>
    <name>ТерминалСбораДанных</name>
    <comment>DataCollectionTerminal</comment>
  </enumValues>
  <enumValues>
    <name>ЭквайринговыйТерминал</name>
    <comment>AcquiringTerminal</comment>
  </enumValues>
  <enumValues>
    <name>ЭлектронныеВесы</name>
    <comment>Scale</comment>
  </enumValues>
  <enumValues>
    <name>ВесыСПечатьюЭтикеток</name>
    <comment>ScaleOffline</comment>
  </enumValues>
  <enumValues>
    <name>УдалитьККМОфлайн</name>
    <comment>ECROffline</comment>
  </enumValues>
  <enumValues>
    <name>ПринтерЭтикеток</name>
    <comment>LabelPrinter</comment>
  </enumValues>
  <enumValues>
    <name>СчитывательRFID</name>
    <comment>RFID</comment>
  </enumValues>
</mdclass:Enum>

БПКР/src/Enums/СпособПодключенияДрайвера/СпособПодключенияДрайвера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособПодключенияДрайвера</name>
  <enumValues>
    <name>ИзМакета</name>
    <comment>Установка драйвера осуществляется из макета конфигурации</comment>
  </enumValues>
  <enumValues>
    <name>ЛокальноПоИдентификатору</name>
    <comment>Подключатся драйвер, установленный на локальном компьютере по ProgID</comment>
  </enumValues>
  <enumValues>
    <name>ИзИнформационнойБазы</name>
    <comment>Установка драйвера осуществляется из информационной базы</comment>
  </enumValues>
  <enumValues>
    <name>ПодключениеНеТребуется</name>
  </enumValues>
</mdclass:Enum>

БПКР/src/CommonModules/ОборудованиеЧекопечатающиеУстройстваОбновление/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Добавляет в список поставляемые драйверы в составе конфигурации.
//
Процедура ОбновитьПоставляемыеДрайвера(ДрайвераОборудования) Экспорт
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ПринтерЧеков;
	Драйвер.ИмяДрайвера  = "Драйвер1СПринтерЧеков";
	Драйвер.Наименование = НСтр("ru = '1С:Принтер чеков'");
	Драйвер.ИдентификаторОбъекта = "ReceiptPrinterNative"; 
	Драйвер.ВерсияДрайвера = "3.1.4.6"; 
	
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	Драйвер.ИмяДрайвера  = "ДрайверКатоОнлайнКасса";
	Драйвер.Наименование = "Като:1С онлайн касса";
	Драйвер.ИдентификаторОбъекта = "ОнлайнКасса";
	Драйвер.СпособПодключения = Перечисления.СпособПодключенияДрайвера.ПодключениеНеТребуется;
	Драйвер.ВерсияДрайвера = "1.0.0.1";
	
КонецПроцедуры

#КонецОбласти
